app/views/articles/show.html.erb

      <span class="views"><%= @article.views %></span>
      <span class="user-name">by <%=  @users.find_by(id: @article.user_id).name %>, </span>
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]