app/views/pokemon/index.html.erb

SELECT "poke_sprites".* FROM "poke_sprites" WHERE "poke_sprites"."pokemon_id" IN ($1, $2)  [["pokemon_id", 980190962], ["pokemon_id", 298486374]]
---
        <figure class="pokemon-sprite">
          <% pokemon.poke_sprites.each do |sprite|%>

SELECT "poke_types".* FROM "poke_types" WHERE "poke_types"."pokemon_id" IN ($1, $2)  [["pokemon_id", 980190962], ["pokemon_id", 298486374]]
---
        <div class="pokemon-type">
          <% pokemon.poke_types.each do |type| %>