app/controllers/main_controller.rb

  def index
    @users = User.all
    @cols = Comment.column_names
    @count = Article.count
---
SELECT COUNT(*) FROM "articles"