app/controllers/pokemon_controller.rb

SELECT "poke_sprites".* FROM "poke_sprites" WHERE "poke_sprites"."pokemon_id" IN ($1, $2)  [["pokemon_id", 980190962], ["pokemon_id", 298486374]]
SELECT "poke_types".* FROM "poke_types" WHERE "poke_types"."pokemon_id" IN ($1, $2)  [["pokemon_id", 980190962], ["pokemon_id", 298486374]]
SELECT 1 AS one FROM "pokemons" LIMIT $1 OFFSET $2  [["LIMIT", 1], ["OFFSET", 0]]
---
  def index
    @pagy, @pokemon = pagy(Pokemon.includes(:poke_sprites, :poke_types)
                                  .search(params[:search]), size: [1, 2, 2, 1], items: 25)
    LoadPokemonDb.perform_async if Pokemon.all.empty? # loads pokemon db on first encounter